color1 = input("Введите первый основной цвет: ")
color2 = input("Введите второй основной цвет: ")
if (color1 == "красный" or color1 == "Красный") and (color2 == "синий" or color2 == "Синий"):
    print("Ваш вторичный цвет - фиолетовый!")
elif (color1 == "красный" or color1 == "Красный") and (color2 == "желтый" or color2 == "Желтый" or color2 == "Жёлтый" or color2 == "жёлтый"):
    print("Ваш вторичный цвет - оранжевый")
elif (color1 == "синий" or color1 == "Синий") and (color2 == "желтый" or color2 == "Желтый" or color2 == "Жёлтый" or color2 == "жёлтый"):
    print("Ваш вторичный цвет - зелёный")
else:
    print("Ошибка, неправильно введён один или несколько основный цветов")